"""
Some temporary scripts
"""
from pprint import pprint as pp
from person.get_quotes import get_quotes
from person.get_quotes import _encode_quotes_in_quotes

# def test_():
#     text = """
#             უკრაინის პრეზიდენტმა ვლადიმერ ზელენსკიმ მიუნხენის უსაფრთხოების კონფერენციაზე
#              სიტყვით გამოსვლისას იმ ვითარებაზე ისაუბრა, რომელიც ქვეყნის შიგნით
#               მიმდინარეობს. როგორც ზელენსკი აღნიშნავს, უკრაინა ყველაფრისთვის მზად არის.

#             "კუბოებში ჩაწოლას და რუსი "სამხედროების" ლოდინს არ ვაპირებთ. ჩვენ
#             არავისზე თავდასხმას არ ვაპირებთ, თუმცა ყველაფრისთვის მზად ვართ."
#             - ამბობს უკრაინის პრეზიდენტი.
#         """
# "111, 222, 333 "444 555" 666 777" - აცხადებს მარიამ მარიამიძე
text = """
            ამერიკის შეერთებული შტატების ყოფილმა სახელმწიფო მდივანმა CNN-თან უკრაინაში არსებული ვითარება შეაფასა. 
            კონდოლიზა რაისმა 2008 წელს რუსეთ-საქართველოს ომზეც ისაუბრა და მიხეილ სააკაშვილთან საუბარი გაიხსენა. როგორც 
            რაისი ამბობს, საქართველოს მაშინდელ პრეზიდენტს უთხრა, რომ რუსეთის პროვოკაციას არ უნდა აჰყოლოდა.

            „ჩვენ ვეუბნებოდით სააკაშვილს, რომ რუსეთი ცდილობდა მის პროვოცირებას. ჩვენ ვაფრთხილებდით მას, არ აჰყოლოდა ამ
             პროვოკაციას, მაგრამ რუსეთმა ეს შეძლებს და ომი დაიწყო. ასეთ დროს ჩვენ ყოველთვის ცუდ მდგომარეობაში ვვარდებით. 
             შეერთებული შტატები არ იქნებოდა მზად ეომა საქართველოს გამო რუსეთთან. შეჭრის შემდეგ ლავროვი იყო კატეგორიული 
             ჩვენთან საუბრისას. ერთ-ერთ მისი მოთხოვნა სააკაშვილის წასვლა იყო“, - განაცხადა რაისმა.
        """


resp = get_quotes(text, v=1)
# resp = _encode_quotes_in_quotes(text)

"""
Not correct results for text on page

https://mtavari.tv/news/74759-nina-khubutia-ukrainuli-mediis-quradghebis

"""

pp(resp)
print("\n" * 4)
print(resp)
