"""
Some temporary scripts
"""
from pprint import pprint as pp
from person.get_quotes import get_quotes
from person.get_quotes import _encode_quotes_in_quotes

# def test_():
#     text = """
#             უკრაინის პრეზიდენტმა ვლადიმერ ზელენსკიმ მიუნხენის უსაფრთხოების კონფერენციაზე
#              სიტყვით გამოსვლისას იმ ვითარებაზე ისაუბრა, რომელიც ქვეყნის შიგნით
#               მიმდინარეობს. როგორც ზელენსკი აღნიშნავს, უკრაინა ყველაფრისთვის მზად არის.

#             "კუბოებში ჩაწოლას და რუსი "სამხედროების" ლოდინს არ ვაპირებთ. ჩვენ
#             არავისზე თავდასხმას არ ვაპირებთ, თუმცა ყველაფრისთვის მზად ვართ."
#             - ამბობს უკრაინის პრეზიდენტი.
#         """
# "111, 222, 333 "444 555" 666 777" - აცხადებს მარიამ მარიამიძე
# „ნაციონალური მოძრაობის“ თავმჯდომარის, ნიკა მელიას განცხადებით, დღეს „ერთიანი ნაციონალური მოძრაობის“ პოლიტიკური საბჭოს სხდომა გაიმართა, რომელზეც გადაწყდა, რომ პარტიის ცენტრალური საკითხი არის მიხეილ სააკაშვილის სიცოცხლის გადარჩენა. ნიკა მელიას თქმით, სააკაშვილის ჯანმრთელობის მდგომარეობა დღითიდღე მძიმდება და აღნიშნა, რომ კონსილიუმის წევრები, უცხოელი ექიმები ერთხმად აღნიშნავენ, რომ მისი მკურნალობა საქართველოში შეუძლებელია. „მოგეხსენებათ, რომ სახალხო დამცველის მიერ შექმნილი კონსილიუმი, ცენტრი „ემპათია“, უცხოელი ექიმები, მიხეილ სააკაშვილის პირადი ექიმი ერთხმად აღნიშნავენ, რომ მიხეილ სააკაშვილის მძიმე ჯანმრთელობის მდგომარეობა, რომელიც დღითიდღე მძიმდება და მძიმდება, არ ექვემდებარება საქართველოში განკურნებას. აქედან გამომდინარე, ერთადერთი გზა მიხეილ სააკაშვილის სიცოცხლის გადარჩენის არის შემდეგი – მიხეილ სააკაშვილი იყოს გადაყვანილი ქვეყნის ფარგლებს გარეთ უცხოურ კლინიკაში, შესაბამისი მკურნალობის მისაღებად. ძალიან დასანანია, რომ ამ ჰუმანიტარული საკითხის გამო გვიწევს პოლიტიკური ბრძოლა. ჰუმანიტარულია ის საკითხი, რომელიც ადამიანის, ქვეყნის მესამე პრეზიდენტის, მიხეილ სააკაშვილის სიცოცხლეს ეხება“, – აღნიშნა მელიამ. მისივე თქმით, პარტიის ყველა აქტივობა დაუკავშირდება მიხეილ სააკაშვილის სიცოცხლის გადარჩენას. „ჩვენ ვიყავით ბრძოლაში და ვრჩებით ბრძოლაში იქამდე, ვიდრე არ იქნება უზრუნველყოფილი მისი სიცოცხლე და ჯანმრთელობა, რაც მიმაჩნია, არის თითოეული ჩვენი პარტიის წევრის, ამომრჩევლის, მხარდამჭერის მთავარი ცენტრალური საკითხი“, – განაცხადა ნიკა მელიამ. მისივე თქმით, 5 მარტიდან სხვადასხვა ქალაქში საპროტესტო აქციები გაიმართება. „სხვადასხვა ფორმისა და შინაარსის საპროტესტო აქტივობები გაიმართება სხვადასხვა ქალაქში. 5 მარტს, 17:00 საათზე რუსთაველის გამზირზე ველოდებით ქვეყნის მოსახლეობის იმ ნაწილს, რომელიც თვლის, რომ ეს ისტორიული უსამართლობა უნდა დასრულდეს და ამ ბრძოლაში არიან“, – განაცხადა ნიკა მელიამ.
text = """

უკრაინას მაინც ვერ აიღებთ. ჩვენი მიწის წინააღმდეგ დაწყებული ომისთვის რუსეთი ტრიბუნალის წინაშე წარსდგება - ზელენსკი
გიორგი პაპავა
Published at Wed, 02 March 2022 | 12:16
Original news on mtavari.tv
უკვე ერთი კვირაა უკრაინა რუსეთის აგრესიას იგერიებს. ომის მე-7 დღეს უკრაინელებს ქვეყნის პრეზიდენტმა, ვოლოდიმირ ზელენსკიმ მიმართა. 

დღეს ომის 7-ე დღეა. ამ 7 დღის განმავლობაში იმაზე უფრო მეტი ერთიანობა ვაჩვენეთ, ვიდრე ბოლო 30 წლის განმავლობაში. გამარჯვების, სიმართლის, მშვიდობის, სიმშვიდის, ჩვენი მოქალაქეების სიცოცხლისა და მომავლისთვის ბრძოლაში ჩვენ ერთიანები გავხდით. ერთმანეთს თვალებში შეხვდეთ, ერთმანეთი შეგვიყვარდა და ერთმანეთს დახმარების ხელს ვუწვდით.

გუშინ დილით, ხარკოვის თავისუფლების მოედანზე, ჩვენ ყველანი ხარკოველები ვიყავით. შემდეგ მტერმა ბოროდიანსკის სახლები დაგვიბომბა. მთელი ღამე კიევში გვბომბავდნენ და ბოლოს ყველანი ბაბინ იართან სარაკეტო იერიშის დროს დავიღუპეთ. ბაბინ იარი კიევისა და ევროპის ისტორიის განუყოფელი ნაწილია. ეს არის იმ 100 ათასი ადამიანის სულების სალოცავი და მოსახსენიებელი ადგილი რომელიც ნაცისტებმა დახოცეს. ვის დასჭირდა რომ ეს ადგილი რაკეტების სამიზნედ ექცია. ჰოლოკოსტის მსხვერპლს მტერი ხელახლა კლავს. ბიბინ იარის სიახლოვეს სატელევიზიო ანძა, სპორტული დარბაზი და პარკი განთავსებული - მაინც არ მესმის რატომ დაბომბეს.

ბევრმა რუსმა ჩვენი დედაქალაქის ისტორია საერთოდ არ იცის, თუმცა მათი მეთაურებისგან ამ ისტორიის, ჩვენი ქვეყნისა და ჩვენი ეროვნების განადგურების ბრძანება აქვთ მიღებული.  ომის პირველ დღეს მტერმა უმი დაბომბა, სადაც ყოველწლიურად ათასობით ებრაელი ჩამოდის სალოცავად, გუშინ კი ბაბინ იარი დაბომბეს, სადაც ნაცისტებმა 100 ათასი ებრაელი დახოცეს. მივმართავ მსოფლიოს ებრაელებს, ნუთუ ვერ ხედავთ რა ხდება ?! მნიშვნელოვანია რომ პირდაპირ ახლა ხმა ამოიღოთ და არ გაჩუმდეთ, რადგან სიჩუმე შობს ნაციზმს. მტერი მთელი ხამის განმავლობაში ბომბავდა ქალაქებს და მშვიდობიან მოქალაქეებს. მარიუპოლი, ხარკოვი, კიევი, ხერსონი და ბევრი სხვა ქალაქები დაიბომბა. ამას ახსნა არ აქვს. რა ღმერთი გაგიწყრათ. რომელი სამხედრო ბაზა იდგა ბაბინ იართან, ან რომელი ნატოს ბაზა არის სოფიას ტაძართან.

ბოლო 7 დღის განმავლობაში მთელი ევროპა და მსოფლიო გავაერთიანეთ. ეს ეხება უბრალო მოქალაქეებსაც.  

გუშინ ევროკავშირი ფეხზე დადგა და უკრაინელ ხალხს ტაში დაგვიკრა... ჩვენ ევროკავშირში გაწევრიანების სწრაფი პროცედურები დავიწყეთ. წარმოიდგინეთ, ნეიტრალურმა შვეიცარიამ, რუსი ოლიგარქებისა და რუსეთის წინააღმდეგ დაწესებულ სანქციებს მხარი დაუჭირა, ვიმეორებ - ნეიტრალური შვეიცარია. არ მესმის სხვა ქვეყნები რას ელოდებიან. ახლა არ შეიძლება ნეიტრალურ პოზიციაზე იყო. ამ დროისთვის 6000 ათასი რუსი სამხედროა დაღუპული. წამოიდგინეთ ეს რამდენი სიცოცხლეა. უკრაინას მაინც ვერ აიღებთ. ჩვენი მიწის წინააღმდეგ დაწყებული ომისთვის რუსეთი ტრიბუნალის წინაშე წარსდგება. ჩემო ძვირფასო უკრაინელებო დადგება დრო, როდესაც მშვიდად დავისვენებთ და დავიძინებთ. ეს ომის, გამარჯვებისა და ერთიანობის შემდეგ მოხდება. დღეს უკრაინელები სიძლიერისა და სიმამაცის სიმბოლოები ხართ. დიდება უკრაინას." ამბობს ზელენსკი.

"""

resp = get_quotes(text, v=1)
# resp = _encode_quotes_in_quotes(text)

"""
Not correct results for text on page

https://mtavari.tv/news/74759-nina-khubutia-ukrainuli-mediis-quradghebis

"""

pp(resp)
print("\n" * 4)
print(resp)
