from country.extract import extract_populated_areas


def test_1():
    text = "იყო და არა იყო რა"
    answer = []

    assert sorted(answer) == extract_populated_areas(text)


def test_2():
    text = """
    „საქართველოს რეგიონული განვითარებისა და ინფრასტრუქტურის სამინისტროს 
    საავტომობილო გზების დეპარტამენტის ინფორმაციით, 
    შიდასახელმწიფოებრივი მნიშვნელობის ქუთაისი(საღორია)-ბაღდათი-აბასთუმანი-ბენარას 
    საავტომობილო გზის 38-ე კმ-ზე ავტოტრანსპორტის მოძრაობა აღდგენილია ცალმხრივად. 
    გაწმენდითი სამუშაოები აქტიურ რეჟიმში გრძელდება ავტოსატრანსპორტო მოძრაობის სრულად აღსადგენად“,
     - აღნიშნულია გავრცელებულ ინფორმაციაში.
    """
    # we do not get very small village names for now, so here just 2 must match
    answer = ["ქუთაისი", "ბაღდათი", "აბასთუმანი"]

    assert sorted(answer) == extract_populated_areas(text)


def test_3():
    text = """
    აღმოსავლეთ საქართველოში მოთხოვნებს აკმაყოფილებს გორის სტადიონი, 
    სადაც „დილასთან“ ერთად თბილისის „დინამო“ ჩაატარებს საშინაო მატჩებს, 
    რადგან ბორის პაიჭაძის სახელობის „დინამო-არენაზე“, 
    ისევე როგორც „მიხეილ მესხზე“ ევროპის 21-წლამდელთა ჩემპიონატის მოსამზადებლად განახლება მიმდინარეობს.

    """
    answer = ["თბილისი", "გორი"]

    assert sorted(answer) == extract_populated_areas(text)


def test_4():
    text = """
    მთავრობის განკარგულებით საახალწლო კონცერტები აჭარაში, ხელვაჩაურის გარდა, ასევე ჩატარდება:

    ქობულეთში – 2023 წლის 6 იანვარს – დაიხარჯება 134 891 ლარი;
    ქედაში – 2023 წლის 3 იანვარს – დაიხარჯება 198 506 ლარი;
    მთავრობის განკარგულების საფუძველზე საახალწლო ღონისძიებების მომსახურების 
    ტენდერის გარეშე შესყიდვებისთვის ჯერ არ მიუმართავთ შუახევისა და ხულოს მუნიციპალიტეტებს.

    """
    answer = [
        "ხელვაჩაური",
        "ქობულეთი",
        "ქედა",
        "შუახევი",
        "ხულო",
    ]

    assert sorted(answer) == extract_populated_areas(text)


def test_5():
    text = """
    ტელეკომპანია რუსთავი 2-ის ოფისი თბილისში მდებარეობს.
    """
    answer = ["თბილისი"]

    assert sorted(answer) == extract_populated_areas(text)


def test_6():
    text = """
    ამჟამად პროდუქცია ფოთის, ხაშურის, ონის, ხობის, წალენჯიხის, 
    ბათუმისა და თბილისის სხვადასხვა პატარა მაღაზიებშია წარმოდგენილი.

    ახალციხელ, ქუთაისელ, ზუგდიდელ, ახმეტელ, ასპინძელ, თელაველ და გურჯაანელ მომხმარებლებს
    მომავალი წლიდან ექნებათ შესაძლებლობა გასინჯონ X.

    """
    answer = [
        "ფოთი",
        "ხაშური",
        "ონი",
        "ხობი",
        "წალენჯიხა",
        "ბათუმი",
        "თბილისი",
        "ახალციხე",
        "ქუთაისი",
        "ზუგდიდი",
        "ახმეტა",
        "ასპინძა",
        "თელავი",
        "გურჯაანი",
    ]

    assert sorted(answer) == extract_populated_areas(text)


def test_7_skip_these_matches_works():
    text = """
    რუსთაველის გამზირზე შოთან ჩემი სახელობისააო.
    """
    answer = []

    assert sorted(answer) == extract_populated_areas(text)
