import pytest
from person.get_quotes import get_quotes


# case 1
@pytest.mark.parametrize(
    "text, expected_result",
    [
        (
            """        "ტესტი", - განაცხადა გიორგი გიორგაძემ""",
            [{"person": "გიორგი გიორგაძე", "quote": "ტესტი", "match_case": 1}],
        ),
        (
            """
            "ჩვენ არ ვართ პანიკაში, ვართ ძალიან თანმიმდევრულები, 
            რომ არ ვუპასუხოთ რაიმე პროვოკაციას" - ვოლოდიმერ ზელენსკი
            """,
            [
                {
                    "person": "ვოლოდიმერ ზელენსკი",
                    "quote": """ჩვენ არ ვართ პანიკაში, ვართ ძალიან თანმიმდევრულები, რომ არ ვუპასუხოთ რაიმე პროვოკაციას""",
                    "match_case": 1,
                }
            ],
        ),
    ],
)
def test_1(text, expected_result):
    assert get_quotes(text) == expected_result


# case 2
@pytest.mark.parametrize(
    "text, expected_result",
    [
        (
            """
                გუშინ გიორგი გიორგაძემ რაღაც გააკეთა.
                "მე გუშინ გავაკეთე რაღაც" - ნათქვამია მის განცხადებაში.
                "გუშინ წინაც ვფიქრობდი, მაგრამ გადავიფიქრე", დაამატა გიორგიმ.
            """,
            [
                {
                    "person": "გიორგი გიორგაძე",
                    "quote": "მე გუშინ გავაკეთე რაღაც",
                    "match_case": 2,
                },
                {
                    "person": "გიორგი გიორგაძე",
                    "quote": "გუშინ წინაც ვფიქრობდი, მაგრამ გადავიფიქრე",
                    "match_case": 2,
                },
            ],
        ),
        #####
        (
            """
            უკრაინის პრეზიდენტის, ვოლოდიმერ ზელენსკის თქმით, ის მიუნხენში, 
            უსაფრთხოების კონფერენციაზე ჩავიდა, რათა შეხვედრაზე უკრაინის ხმა გაჟღერებულიყო.
            ამის შესახებ ვოლოდიმერ ზელენსკიმ CNN-ს გერმანიაში განუცხადა.

            "მე ვარ პრეზიდენტი, ძალიან მნიშვნელოვანია ყველა ჩვენი პარტნიორისა
             და მეგობრისთვის, რომ არ მოხდეს შეთანხმება ჩვენს ზურგს უკან. ჩვენ არ ვართ პანიკაში, 
             ჩვენ ძალიან თანმიმდევრულები ვართ, რომ არ ვუპასუხოთ რაიმე პროვოკაციას," - თქვა ზელენსიმ.
            
            მანამდე, ვოლოდიმერ ზელენსკიმ კონფერენციის წევრები შესაძლო 
            ფართომასშტაბიანი ომის შესახებ გააფრთხილა - "მოისმენს ჩემს ხმას მსოფლიო 2022 წელს?" - იკითხა მან. 
            """,
            [
                {
                    "person": "ვოლოდიმერ ზელენსკი",
                    "quote": """მე ვარ პრეზიდენტი, ძალიან მნიშვნელოვანია ყველა ჩვენი პარტნიორისა და მეგობრისთვის, რომ არ მოხდეს შეთანხმება ჩვენს ზურგს უკან. ჩვენ არ ვართ პანიკაში, ჩვენ ძალიან თანმიმდევრულები ვართ, რომ არ ვუპასუხოთ რაიმე პროვოკაციას,""",
                    "match_case": 2,
                },
                {
                    "person": "ვოლოდიმერ ზელენსკი",
                    "quote": "მოისმენს ჩემს ხმას მსოფლიო 2022 წელს?",
                    "match_case": 2,
                },
            ],
        ),
        #####
        (
            """
            უკრაინის პრეზიდენტმა ვლადიმერ ზელენსკიმ მიუნხენის უსაფრთხოების კონფერენციაზე სიტყვით
             გამოსვლისას იმ ვითარებაზე ისაუბრა, რომელიც ქვეყნის შიგნით მიმდინარეობს. როგორც ზელენსკი 
            აღნიშნავს, უკრაინა ყველაფრისთვის მზად არის. 

            "კუბოებში ჩაწოლას და რუსი სამხედროების ლოდინს არ ვაპირებთ. ჩვენ არავისზე თავდასხმას არ ვაპირებთ, 
            თუმცა ყველაფრისთვის მზად ვართ." - ამბობს უკრაინის პრეზიდენტი.
             
            ომის ზღვარზე მყოფი ქვეყნის პრეზიდენტმა კონფერენციის წევრებს კითხვით მიმართა -
            წარმოუდგენიათ თუ არა იმ სახელმწიფოში ცხოვრება, რომელსაც ყოველ დღე ეუბნებიან, რომ ხვალ ომია.

            "ჩვენ არ შეგვიძლია ვიყოთ პასიურები, არ შეგვიძლია ყოველ დღე ვთქვათ, 
            რომ ხვალ ომია. რომელ ეკონომიკაზე შეიძლება იყოს ამის შემდეგ საუბარი. 
            როგორ შეიძლება ცხოვრება სახელმწიფოში, როდესაც ყოველ დღე გეუბნებიან, 
            რომ ხვალ თავს დაგესხმებიან. მაშინ ხდება ეროვნული ვალუტის ჩამოშლა, 
            გააქვთ ფული, ბიზნესი გადის ქვეყნიდან. როგორ ფიქრობთ: შეიძლება ასეთ სახელმწიფოში ცხოვრება? 
            შეიძლება ასეთ სახელმწიფოში სტაბილურობა იყოს? არა!"- განაცხადა ზელენსკიმ.

            მისი თქმით, უკრაინელები არ ნებდებიან, მათ სურთ რომ იცხოვრონ ყოველ დღე და დაიცვან საკუთარი ქვეყანა. 
            "მათ სურთ, რომ უკრაინა სუსტი იყოს, ჰქონდეს სუსტი ეკონომიკა, ჰყავდეს 
            სუსტი ჯარი - მაშინ ჩვენზე თავდასხმა შესაძლებელი იქნება. 
            ჩვენ ვერ შევძლებთ, ვერც ჩვენი ხალხის დაცვას, ვერც ეკონომიკის, 
            ამიტომ ჩვენ მშვიდად ვრეაგირებთ ამა თუ იმ ინფორმაციაზე. ჩვენ ჰიბრიდული ომის პირობებში ვართ. 
            ამიტომ უკრაინელები არ ნებდებიან ამ სიტყვის ყველა მნიშვნელობით. 
            ჩვენ გვსურს ვიცხოვროთ ყოველ დღე და ვიცავდეთ ჩვენს სახელმწიფოს. 
            ჩვენ უბრალოდ გვსურს ვიცხოვროთ, როგორც ძლიერმა სახელმწიფომ,"- განაცხადა ზელენსკიმ. 
            
            """,
            [
                {
                    "person": "ვლადიმერ ზელენსკი",
                    "quote": """კუბოებში ჩაწოლას და რუსი სამხედროების ლოდინს არ ვაპირებთ. ჩვენ არავისზე თავდასხმას არ ვაპირებთ, თუმცა ყველაფრისთვის მზად ვართ.""",
                    "match_case": 2,
                },
                {
                    "person": "ვლადიმერ ზელენსკი",
                    "quote": """ჩვენ არ შეგვიძლია ვიყოთ პასიურები, არ შეგვიძლია ყოველ დღე ვთქვათ, რომ ხვალ ომია. რომელ ეკონომიკაზე შეიძლება იყოს ამის შემდეგ საუბარი. როგორ შეიძლება ცხოვრება სახელმწიფოში, როდესაც ყოველ დღე გეუბნებიან, რომ ხვალ თავს დაგესხმებიან. მაშინ ხდება ეროვნული ვალუტის ჩამოშლა, გააქვთ ფული, ბიზნესი გადის ქვეყნიდან. როგორ ფიქრობთ: შეიძლება ასეთ სახელმწიფოში ცხოვრება? შეიძლება ასეთ სახელმწიფოში სტაბილურობა იყოს? არა!""",
                    "match_case": 2,
                },
                {
                    "person": "ვლადიმერ ზელენსკი",
                    "quote": """მათ სურთ, რომ უკრაინა სუსტი იყოს, ჰქონდეს სუსტი ეკონომიკა, ჰყავდეს სუსტი ჯარი - მაშინ ჩვენზე თავდასხმა შესაძლებელი იქნება. ჩვენ ვერ შევძლებთ, ვერც ჩვენი ხალხის დაცვას, ვერც ეკონომიკის, ამიტომ ჩვენ მშვიდად ვრეაგირებთ ამა თუ იმ ინფორმაციაზე. ჩვენ ჰიბრიდული ომის პირობებში ვართ. ამიტომ უკრაინელები არ ნებდებიან ამ სიტყვის ყველა მნიშვნელობით. ჩვენ გვსურს ვიცხოვროთ ყოველ დღე და ვიცავდეთ ჩვენს სახელმწიფოს. ჩვენ უბრალოდ გვსურს ვიცხოვროთ, როგორც ძლიერმა სახელმწიფომ,""",
                    "match_case": 2,
                },
            ],
        ),
        #####
    ],
)
def test_2(text, expected_result):
    assert get_quotes(text) == expected_result


#
#
#
#
#
#
#
#
#
#


# def test_():
#     text = """
#             უკრაინის პრეზიდენტმა ვლადიმერ ზელენსკიმ მიუნხენის უსაფრთხოების კონფერენციაზე
#              სიტყვით გამოსვლისას იმ ვითარებაზე ისაუბრა, რომელიც ქვეყნის შიგნით
#               მიმდინარეობს. როგორც ზელენსკი აღნიშნავს, უკრაინა ყველაფრისთვის მზად არის.

#             "კუბოებში ჩაწოლას და რუსი "სამხედროების" ლოდინს არ ვაპირებთ. ჩვენ
#             არავისზე თავდასხმას არ ვაპირებთ, თუმცა ყველაფრისთვის მზად ვართ."
#             - ამბობს უკრაინის პრეზიდენტი.
#         """
"""
უკრაინის პრეზიდენტმა ვლადიმერ ზელენსკიმ მიუნხენის უსაფრთხოების კონფერენციაზე
სიტყვით გამოსვლისას იმ ვითარებაზე ისაუბრა, რომელიც ქვეყნის შიგნით
მიმდინარეობს. როგორც ზელენსკი აღნიშნავს, უკრაინა ყველაფრისთვის მზად არის.

"კუბოებში ჩაწოლას და რუსი 'სამხედროების' ლოდინს არ ვაპირებთ. ჩვენ
არავისზე თავდასხმას არ ვაპირებთ, თუმცა ყველაფრისთვის მზად ვართ."
- ამბობს უკრაინის პრეზიდენტი
"""
