
def get_retrieved_name_surnames():
    name_surnames = ["ტომ ჰალერანი","ენ კირკპატრიკი","რაულ გრიჯალვა","რუბენ გალეგო","გრეგ სტენტონი","ჯარედ ჰაფმანი","იოანე გარამენდი","მაიკ ტომპსონი","დორის მაცუი","ამი ბერა","ჯერი მაკნერნი","ჯოშ ჰარდერი","მარკ დე სოლნიერი","ნენსი პელოსი","ბარბარა ლი","ჯეკი სპიერი","ერიკ სვალუელი","ჯიმ კოსტა","რო ხანა","ანა გ ეშოო","ზოი ლოფგრენი","ჯიმი პანეტა","სალუდ კარბაჯალი","ჯულია ბრაუნლი","ჯუდი ჩუ","ადამ შიფი","ტონი კარდენასი","ბრედ შერმანი","პიტ აგილარი","გრეის ნაპოლიტანო","ტედ ლიუ","ჯიმი გომესი","ნორმა ტორესი","რაულ რუისი","კარენ ბასი","ლინდა სანჩესი","ლუსილ როიბალ-ოლარდი","მარკ ტაკანო","მაქსინ უოტერსი","ნანეტ ბარაგანი","ქეთი პორტერი","ლუ კორეა","ალან ლოვენტალი","მაიკ ლევინი","ხუან ვარგასი","სკოტ პიტერსი","სარა ჯეიკობსი","დიანა დეჟეტი","ჯოზეფ ნეგუზე","ჯეისონ ქროუ","ედ პერლმუტერი","ჯონ ლარსონი","ჯო კორტნი","როზა დელაურო","ჯიმ ჰიმსი","ჯაჰანა ჰეისი","ლიზა ბლანტი როჩესტერი","ელეონორ ჰოლმს ნორტონი","ალ ლოუსონი","სტეფანი მერფი","დარენ სოტო","ვალ დემინგსი","ჩარლი კრისტი","ქეთი კასტორი","შეილა ჩერფილუს-მაკკორმიკი","ლოის ფრანკელი","ტედ დოიჩი","დები ვასერმან შულცი","ფრედერიკა ვილსონი","ჰენკ ჯონსონი","ნიკემა უილიამსი","ლუსი მაკბატი","კაროლინ ბურდო","დევიდ სკოტი","მაიკლ სან ნიკოლოზი","ედ ქეისი","კაი კაჰელი","ბობი ლ რაში","რობინ კელი","მარი ნიუმენი","ჯესუს ჩუი გარსია","მაიკ ქუიგლი","შონ კასტენი","დენი კ დევისი","რაჯა კრიშნამოორთი","იან შაკოვსკი","ბრედ შნაიდერი","ბილ ფოსტერი","ლორენ ანდერვუდი","ჩერი ბუსტოსი","ფრენკ მრვანი","ანდრე კარსონი","სინდი აქსნე","შარის დევიდსი","ჯონ იარმუტი","ტროი კარტერი","ჩელი პინგრი","ჯარედ გოლდენი"," გიორგი რუპერსბერგერი","ჯონ სარბანესი","ენტონი ბრაუნი","სტენი ჰოიერი","დევიდ ტრონი", "ჯეიმი რასკინი","რიჩარდ ე.ნილი","ჯიმ მაკგოვერნი","ლორი ტრაჰანი","ჯეიკ ოჩინკლოსი","კეტრინ კლარკი","სეთ მულტონი","აიანა პრესლი","სტივენ ლინჩი","ბილ კიტინგი","დენ კილდი","ელისა სლოტკინი","ენდი ლევინი","ჰეილი სტივენსი","დები დინგელი","რაშიდა თლაიბი","ბრენდა ლოურენსი","ენჯი კრეიგი","დინ ფილიპსი","ბეტი მაკკოლუმი","ილჰან ომარი","ბენი ტომპსონი","კორი ბუში","ემანუელ კლივერი","დინა ტიტუსი","სუზი ლი","სტივენ ჰორსფორდი","კრის პაპასი","ენ მაკლეინ კუსტერი","დონალდ ნორკოსი","ენდი კიმი","ჯოშ გოტტეიმერი","ფრენკ პალონე","ტომ მალინოვსკი","ალბიო სირეს","ბილ პასკრელი","დონალდ პეინი","მიკი შერილი","ბონი უოტსონ კოულმენი","მელანი სტენსბერი","ტერეზა ლეგერ ფერნანდესი","თომას სუოზი","კეტლინ რაისი","გრეგორი უ. მიქსი","გრეის მენგი","ნიდია მ. ველასკესი","ჰაკიმ ჯეფრისი","ივეტ დ. კლარკი","ჯეროლდ ნადლერი","კაროლინ ბ. მალონი","ადრიანო ესპაილატი","ალექსანდრია ოკასიო-კორტესი","რიჩი ტორესი","ჯამაალ ბოუმენი","მონდერ ჯონსი","შონ პატრიკ მალონი","ანტონიო დელგადო","პოლ დ.ტონკო","ჯოზეფ მორელი","ბრაიან ჰიგინსი","გ.კ. ბატერფილდი","დებორა როსი","დევიდ ე ფასი","ქეთი მენინგი","ალმა ადამსი","გრეგორიო კილილი კამაჩო საბლან","ჯოის ბიტი","მარსი კაპტური","შონტელ ბრაუნი","ტიმ რაიანი","სიუზან ბონამიჩი","ერლ ბლუმენაუერი","პიტერ დეფაციო","კურტ შრეიდერი","ბრენდან ბოილი","დუაიტ ევანსი","მადლენ დინი","მერი გეი სკანლონი","კრისი ჰულაჰანი","სიუზან უაილდი","მეტ კარტრაიტი","კონორ ლამბი","მაიკ დოილი","დევიდ ციცილინი","ჯიმ ლანჟევინი","ჯიმ კლიბერნი","ჯიმ კუპერი","სტივ კოენი","ლიზი ფლეტჩერი","ალ გრინი","ვისენტე გონსალესი","ვერონიკა ესკობარი","შეილა ჯექსონ-ლი","ხოაკინ კასტრო","ჰენრი კუელარი","სილვია გარსია","ედი ბერნის ჯონსონი","კოლინ ალრედი","მარკ ვეისი","ფილემონ ველა","ლოიდ დოგეტი","პიტერ უელჩი","სტეისი პლასკეტი","ელეინ ლურია","ბობი სკოტი","დონალდ მაკეჩინი","აბიგაილ სპანბერგერი","დონ ბეიერი","ჯენიფერ უექსტონი","გერი კონოლი","სიუზან დელბენე","რიკ ლარსენი","დერეკ კილმერი","პრამილა ჯაიაპალი","კიმ შრიერი","ადამ სმიტი","მერილინ სტრიკლენდი","მარკ პოკანი","რონ კეთილი","გვენ მური"]

    names = set()
    surnames = set()

    for name_surname in name_surnames:
        # as we store empty name_surnames if it seems invalid
        if not name_surname: continue

        
        name, surname = name_surname.rsplit(" ", maxsplit=1)

        for n in name.split("-"):
            for char in n.split(" "):
                if "." in char:
                    continue

                if len(char) > 1 and not char.isdigit():
                    names.add(char)
        
        for s in surname.split("-"):
            if not s.isdigit():
                surnames.add(s)

    print(f'\nunique {len(names)=}, unique {len(surnames)=}')

    return names, surnames


def get_name_surnames_not_in_person_init_listings(names :set, surnames :set):
    import sys

    sys.path.append('/home/tornike/Desktop/nerge/')

    from person import NAMES, SURNAMES

    new_names = names - NAMES
    new_surnames = surnames - SURNAMES
    
    print(f'\n{len(new_names)=}, {len(new_surnames)=}')

    return new_names, new_surnames


if __name__ == "__main__":
    
    
    names, surnames = get_retrieved_name_surnames()
    
    new_names, new_surnames = get_name_surnames_not_in_person_init_listings(names, surnames)
    
